'''
接口测试全局参数配置
'''
class cdatas:
    '全局参数'
    cpid = 5            #产品编号
    npid = 10           #定向产品编号
    agencyid = 0        #机构编号
    projectid = 4       #项目编号-标准
    nprojectid = 296    #项目编号-非标
    oprojectid = 4      #项目编号-定向
    pacommitid = 382    #委员会会议id--标准
    npacommitid = 0     #委员会会议id--非标
    opacommitid = 1     #委员会会议id--定向
    cpacommitid = 0     #委员会会议id--投资
    approvaid = 78      #立项会id-标准
    napprovaid = 480    #立项会id-非标
    oapprovaid = 12     #立项会id-定向
    reportid = 13       #集合季报id
    dispatchid = 210    #发文id
    sitemsid = 0        #标准标的id
    nitemsid = 150        #非标标的id
    spoolid = 0         #标准出入池id
    npoolid = 42         #非标出入池id

# 项目类型
product_type = {
    '标准':1,
    '非标':2,
    '定向':3
}

# 标准项目状态
prostatus = {
    '草稿':1,      
    '立项中':2,      
    '待过会':3,   
    '过会中':4,  
    '已过会':5,   
    '已废弃':6,
    '已运作':90
}

# 非标项目状态
nprostatus = {
    '草稿':1,
    '接洽中':2,
    '待尽调':3,
    '尽调中':4,
    '待立项':5,      
    '立项中':6,      
    '待过会':7,   
    '过会中':8,  
    '已过会':9,   
    '已废弃':10,
    '待接洽':20,
    '已运作':90
}

# 定向项目状态
oprostatus = {
    '草稿':1,
    '接洽中':2,
    '待尽调':3,
    '尽调中':4,
    '待立项':5,      
    '立项中':6,      
    '待过会':7,   
    '过会中':8,  
    '已过会':9,   
    '已废弃':10,
    '待接洽':20,
    '已运作':90
}

#流程主题
flowtheme = {
    '新增主产品':1,
    '募集发行':2,
    '验资成立':3,
    '产品备案':4,
    '清算':5,
    '划款指令流程':11,
    '交易指令流程':12,
    '集合标准-项目成立':13,
    '集合标准资产管理委员会':14,
    '集合非标资产管理委员会':15,
    '集合非标-项目立项':16,
    '集合非标-项目接洽':17,
    '定向-项目立项':18,
    '定向-资产委员会':19,
    '定向-项目接洽':20,
    '资管季报流程':21,
    '资产管理委员会':22,
    '非标-标的入库':24,
    '非标-标的入池':25,
    '非标-标的出池':26,
    '非标-标的出库':27
}

#委员会状态
committeestatus = {
    '待发起':1,
    '委员表决':2,
    '总结意见':3,
    '终止':4,
    '结束':5,
    '已废弃':6
}

#季报流程状态
process = {
    '待发起':1,
    '投资主办待审':2,
    '待复核':3,
    '结束':4,
    '调整数据':5
}

#发文状态
document = {
    '未发文':1,
    '已发文':2
}

# 非标标的状态
nitemsstatus = {
    '草稿':1,
    '入库中':2,
    '已入库':3,
    '使用中':4,
    '出库中':5,
    '已出库':6
}